[
    {
        "source": {
            "id": null,
            "name": "Mmafighting.com"
        },
        "id":1,
        "author": "MMA Fighting Newswire",
        "isLocalArticle": true,
        "title": "Conor McGregor questions why ‘worm’ Kelvin Gastelum is holding UFC belt - MMA Fighting",
        "description": "Conor McGregor didn’t take too kindly to Kelvin Gastelum insisting that he is the new middleweight champion.",
        "url": "https://www.mmafighting.com/2019/2/10/18218976/conor-mcgregor-questions-why-worm-kelvin-gastelum-is-holding-ufc-belt",
        "urlToImage": "https://cdn.vox-cdn.com/thumbor/-PVgoBcGqF0C8ztMWymwEJapj0k=/0x0:1920x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13218219/115_Conor_McGregor.jpg",
        "publishedAt": "2019-02-10T13:00:00Z",
        "content": "Conor McGregor knows a thing or two about UFC titles and he wasnt pleased to see Kelvin Gastelum flaunting one this weekend. Gastelum was booked to challenge middleweight champion Robert Whittaker in the main event of UFC 234 on Saturday in Melbourne, Austral… [+2409 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Npr.org"
        },
        "id":2,
        "author": "Fighting Newswire",
        "title": "Why We Can't Break Up With Big Tech - NPR",
        "description": "Gizmodo's Kashmir Hill spent six weeks trying to cut Amazon, Facebook, Google, Microsoft and Apple out of her life completely. \"Spoiler,\" she says. \"It's not possible.\"",
        "url": "https://www.npr.org/2019/02/10/692877140/why-we-cant-break-up-with-big-tech",
        "urlToImage": "https://media.npr.org/assets/img/2019/02/09/ap_1603022305274749_wide-04d5f758011c4b25d530c2e6cc252e871280f21c.jpg?s=1400",
        "publishedAt": "2019-02-10T12:27:00Z",
        "content": "Gizmodo's Kashmir Hill tried to disconnect from all Amazon products â including its smart speakers â as part of a bigger experiment in living without the major tech players. Jeff Chiu/AP Kashmir Hill wanted Amazon out of her life, completely. It was the f… [+5747 chars]"
    },
    {
        "source": {
            "id": "al-jazeera-english",
            "name": "Al Jazeera English"
        },
        "id":3,
        "author": "Al Jazeera",
        "isLocalArticle": true,
        "title": "'Heavy clashes' in Syria as SDF launches final push against ISIL - Aljazeera.com",
        "description": "US-backed Kurdish forces are advancing in eastern province of Deir Az Zor as battle against ISIL is under way.",
        "url": "https://www.aljazeera.com/news/2019/02/clashes-sdf-launches-push-isil-190210112828641.html",
        "urlToImage": "https://www.aljazeera.com/mritems/Images/2018/12/29/ef46253d8ec94dbcb740457c7eb43696_18.jpg",
        "publishedAt": "2019-02-10T12:00:00Z",
        "content": "The US-backed and Kurdish-led Syrian forces were locked in fierce fighting on Sunday in their final push to defeat the Islamic State of Iraq and the Levant ( ISIL, also known as ISIS) group in the last pocket it holds in eastern Syria. The group overran large… [+2344 chars]"
    },
    {
        "source": {
            "id": "reuters",
            "name": "Reuters"
        },
        "id":4,
        "author": "Reuters Editorial",
        "title": "Saudi Arabia says has 'nothing to do' with Bezos-AMI dispute - Reuters",
        "description": "Saudi Arabia had \"absolutely nothing to do\" with the National Enquirer's reporting on an extramarital relationship involving Amazon.com Inc Chief Executive Jeff Bezos, the kingdom's minister of state for foreign affairs said.",
        "url": "https://www.reuters.com/article/us-people-bezos-saudi/saudi-arabia-says-has-nothing-to-do-with-bezos-ami-dispute-idUSKCN1PZ0BG",
        "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190210&t=2&i=1355097331&w=1200&r=LYNXNPEF1909H",
        "publishedAt": "2019-02-10T11:55:00Z",
        "content": "DUBAI (Reuters) - Saudi Arabia had “absolutely nothing to do” with the National Enquirer’s reporting on an extramarital relationship involving Amazon.com Inc Chief Executive Jeff Bezos, the kingdom’s minister of state for foreign affairs said. Bezos on Thursd… [+1338 chars]"
    },
    {
        "source": {
            "id": "politico",
            "name": "Politico"
        },
        "id":5,
        "author": "ELENA SCHNEIDER",
        "title": "Klobuchar's opening pitch sidetracked by staff horror stories - POLITICO",
        "description": "The senator is positioning herself as a Midwestern antidote to Trump in 2020, but her treatment of staff has become an obstacle.",
        "url": "https://www.politico.com/story/2019/02/10/amy-klobuchar-2020-staff-horror-stories-1160780",
        "urlToImage": "https://static.politico.com/af/1f/599494fb4fe3b22b9f52fe3ef673/1929-amy-klobuchar-gty-773.jpg",
        "publishedAt": "2019-02-10T11:54:00Z",
        "content": "Sen. Amy Klobuchars Senate office has cycled through staff at a higher rate than most others. | Alex Wong/Getty Images MINNEAPOLIS Sen. Amy Klobuchar is pitching herself for the White House as the common-sense Midwestern answer to President Donald Trump while… [+6641 chars]"
    },
    {
        "source": {
            "id": "al-jazeera-english",
            "name": "Al Jazeera English"
        },
        "id":6,
        "author": "Al Jazeera",
        "title": "US, Russia present rival UN draft resolutions on Venezuela - Aljazeera.com",
        "description": "As US and Russia compete within UN on backing opposing factions, another colonel shifts side in support of Guaido.",
        "url": "https://www.aljazeera.com/news/2019/02/russia-present-rival-draft-resolutions-venezuela-190210085959911.html",
        "urlToImage": "https://www.aljazeera.com/mritems/Images/2019/2/10/4060e727ca9849559ebd38e5e81a4b32_18.jpg",
        "publishedAt": "2019-02-10T11:12:00Z",
        "content": "The United States has presented a draft resolution on Venezuela to the United Nations Security Council, triggering a Russian counterproposal. The US draft resolution calls for international aid deliveries and presidential elections in Venezuela while stressin… [+2828 chars]"
    },
    {
        "source": {
            "id": "the-hill",
            "name": "The Hill"
        },
        "id":7,
        "author": "Jordan Fabian and Mike Lillis",
        "isLocalArticle": true,
        "title": "Trump, Dems have reasons to work together, but tensions are boiling over | TheHill - The Hill",
        "description": "Tensions between President Trump and Capitol Hill Democrats have reached a boiling point just a month into the new Congress, highlighting the gulf between the parties under divided government and dimming prospects for bipartisan action this year.",
        "url": "https://thehill.com/homenews/administration/429210-trump-dems-have-reasons-to-work-together-but-tensions-are-boiling",
        "urlToImage": "https://thehill.com/sites/default/files/demtensions_sotu_020519getty.jpg",
        "publishedAt": "2019-02-10T11:00:07Z",
        "content": "Tensions between President Trump Donald John Trump Rob Lowe mocks Warren over Native American ancestry claims Obama health official blasts Trump's physical exam: 'No doctor can predict someones future health' Trump makes Native American joke about Warren camp… [+9526 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Sciencealert.com"
        },
        "id":8,
        "author": "Mike McRae",
        "isLocalArticle": true,
        "title": "Vaccinations Soar by 500% in US County Where Measles Is Out of Control - ScienceAlert",
        "description": "Clark County in the US state of Washington has a measles problem. Since the start of the year, a shocking 50 cases have been counted, a number that is more likely going to rise further before it falls.",
        "url": "https://www.sciencealert.com/vaccinations-boom-by-500-percent-in-us-county-where-measles-is-out-of-control",
        "urlToImage": "https://www.sciencealert.com/images/2019-02/processed/GettyImages-494711993_web_1024.jpg",
        "publishedAt": "2019-02-10T10:57:40Z",
        "content": "Clark County in the US state of Washington has a measles problem. Since the start of the year, a shocking 50 cases have been counted, a number that is more likely going to rise further before it falls. This really shouldn't be all that surprising. In 2017, ju… [+2707 chars]"
    },
    {
        "source": {
            "id": "reuters",
            "name": "Reuters"
        },
        "id":9,
        "author": "William James",
        "isLocalArticle": true,
        "title": "UK's May to promise new Brexit debate in push for more negotiating... - Reuters",
        "description": "Prime Minister Theresa May will pledge this week to give parliament another chance to voice their opinions on Brexit by Feb. 27 as she tries to buy more time to negotiate a new deal with the European Union.",
        "url": "https://www.reuters.com/article/us-britain-eu/uks-may-to-promise-new-brexit-debate-in-push-for-more-negotiating-time-idUSKCN1PZ09S",
        "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190210&t=2&i=1355124018&w=1200&r=LYNXNPEF190DR",
        "publishedAt": "2019-02-10T10:41:00Z",
        "content": "LONDON (Reuters) - Prime Minister Theresa May will pledge this week to give parliament another chance to voice their opinions on Brexit by Feb. 27 as she tries to buy more time to negotiate a new deal with the European Union. As the clock ticks down to Britai… [+3227 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Sciencealert.com"
        },
        "id":10,
        "author": "AYLIN WOODWARD, DAVE MOSHER, Business Insider",
        "title": "\"We've Never Seen Something Like This Orbiting The Sun\": Ultima Thule Is Still Weird - ScienceAlert",
        "description": "The most distant object our species has ever visited, a space rock called 2014 MU69, is less snowman-shaped than scientists previously thought.",
        "url": "https://www.sciencealert.com/we-ve-never-seen-something-like-this-orbiting-the-sun-ultima-thule-is-still-weird",
        "urlToImage": "https://www.sciencealert.com/images/2019-02/processed/UltimaThulenew_web_1024.jpg",
        "publishedAt": "2019-02-10T10:40:33Z",
        "content": "The most distant object our species has ever visited, a space rock called 2014 MU69, is less snowman-shaped than scientists previously thought. NASA flew its New Horizons probe by the rock, which is nicknamed Ultima Thule and located 4 billion miles from Eart… [+2272 chars]"
    }
]